fio_test/test_largefiles_randrw_fuse
largefiles_randrw_fuse: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 4 processes

largefiles_randrw_fuse: (groupid=0, jobs=4): err= 0: pid=40325: Sun Jun 22 17:39:56 2025
  read: IOPS=6651, BW=26.0MiB/s (27.2MB/s)(1559MiB/60002msec)
    slat (usec): min=3, max=59891, avg=360.00, stdev=496.15
    clat (usec): min=1418, max=83637, avg=12967.95, stdev=3697.55
     lat (usec): min=1813, max=84448, avg=13328.48, stdev=3780.62
    clat percentiles (usec):
     |  1.00th=[ 7832],  5.00th=[ 8979], 10.00th=[ 9634], 20.00th=[10552],
     | 30.00th=[11207], 40.00th=[11731], 50.00th=[12387], 60.00th=[13042],
     | 70.00th=[13698], 80.00th=[14746], 90.00th=[16319], 95.00th=[18220],
     | 99.00th=[28443], 99.50th=[32637], 99.90th=[40633], 99.95th=[44827],
     | 99.99th=[78119]
   bw (  KiB/s): min=10408, max=31199, per=100.00%, avg=26650.08, stdev=761.03, samples=476
   iops        : min= 2602, max= 7799, avg=6662.22, stdev=190.25, samples=476
  write: IOPS=2858, BW=11.2MiB/s (11.7MB/s)(670MiB/60002msec); 0 zone resets
    slat (usec): min=19, max=24766, avg=539.93, stdev=508.72
    clat (usec): min=1503, max=83832, avg=13211.65, stdev=3727.91
     lat (usec): min=2904, max=85104, avg=13752.26, stdev=3832.68
    clat percentiles (usec):
     |  1.00th=[ 8029],  5.00th=[ 9241], 10.00th=[ 9896], 20.00th=[10814],
     | 30.00th=[11469], 40.00th=[11994], 50.00th=[12649], 60.00th=[13304],
     | 70.00th=[13960], 80.00th=[14877], 90.00th=[16581], 95.00th=[18482],
     | 99.00th=[29230], 99.50th=[33424], 99.90th=[41681], 99.95th=[45351],
     | 99.99th=[77071]
   bw (  KiB/s): min= 4792, max=13361, per=100.00%, avg=11449.36, stdev=321.57, samples=476
   iops        : min= 1198, max= 3340, avg=2862.04, stdev=80.39, samples=476
  lat (msec)   : 2=0.01%, 4=0.01%, 10=12.72%, 20=83.87%, 50=3.38%
  lat (msec)   : 100=0.03%
  cpu          : usr=1.80%, sys=14.22%, ctx=674377, majf=4, minf=127
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=399089,171487,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=26.0MiB/s (27.2MB/s), 26.0MiB/s-26.0MiB/s (27.2MB/s-27.2MB/s), io=1559MiB (1635MB), run=60002-60002msec
  WRITE: bw=11.2MiB/s (11.7MB/s), 11.2MiB/s-11.2MiB/s (11.7MB/s-11.7MB/s), io=670MiB (702MB), run=60002-60002msec